{"keras_version": "2.1.6-tf", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "conv1", "kernel_size": [7, 7], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "bn_conv1", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn_conv1", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "name": "activation", "config": {"activation": "relu", "name": "activation", "trainable": true, "dtype": "float32"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation", 0, 0, {}]]], "name": "max_pooling2d", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [3, 3], "trainable": true, "name": "max_pooling2d", "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "res2a_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2a_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "name": "bn2a_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "res2a_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res2a_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "name": "bn2a_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "res2a_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2a_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "name": "res2a_branch1", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2a_branch1", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "name": "bn2a_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "name": "bn2a_branch1", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2a_branch1", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "name": "add", "config": {"trainable": true, "name": "add", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "res2b_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2b_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "name": "bn2b_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2b_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "res2b_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res2b_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "name": "bn2b_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2b_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "res2b_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2b_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "name": "bn2b_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2b_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_3", 0, 0, {}]]], "name": "add_1", "config": {"trainable": true, "name": "add_1", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "res2c_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2c_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "name": "bn2c_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2c_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "res2c_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res2c_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "name": "bn2c_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2c_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "res2c_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res2c_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "name": "bn2c_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn2c_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_6", 0, 0, {}]]], "name": "add_2", "config": {"trainable": true, "name": "add_2", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res3a_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3a_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "name": "bn3a_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "res3a_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res3a_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "name": "bn3a_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "res3a_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3a_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "res3a_branch1", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3a_branch1", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "name": "bn3a_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "name": "bn3a_branch1", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3a_branch1", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "name": "add_3", "config": {"trainable": true, "name": "add_3", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "res3b_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3b_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "name": "bn3b_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3b_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "res3b_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res3b_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "name": "bn3b_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3b_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "res3b_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3b_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "name": "bn3b_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3b_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "add_4", "config": {"trainable": true, "name": "add_4", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "res3c_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3c_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "name": "bn3c_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3c_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "res3c_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res3c_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "name": "bn3c_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3c_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "res3c_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3c_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "name": "bn3c_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3c_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_15", 0, 0, {}]]], "name": "add_5", "config": {"trainable": true, "name": "add_5", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "res3d_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3d_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "name": "bn3d_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3d_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "res3d_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res3d_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "name": "bn3d_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3d_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "name": "activation_20", "config": {"activation": "relu", "name": "activation_20", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "res3d_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res3d_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 512, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "name": "bn3d_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn3d_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "add_6", "config": {"trainable": true, "name": "add_6", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_21", "config": {"activation": "relu", "name": "activation_21", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res4a_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res4a_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "name": "bn4a_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn4a_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "res4a_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res4a_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "name": "bn4a_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn4a_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "res4a_branch2c", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res4a_branch2c", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "res4a_branch1", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res4a_branch1", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 1024, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [2, 2], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "name": "bn4a_branch2c", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn4a_branch2c", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "name": "bn4a_branch1", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn4a_branch1", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "name": "add_7", "config": {"trainable": true, "name": "add_7", "dtype": "float32"}}, {"class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "res4b_branch2a", "config": {"activation": "linear", "padding": "valid", "kernel_regularizer": null, "name": "res4b_branch2a", "kernel_size": [1, 1], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "name": "bn4b_branch2a", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn4b_branch2a", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": true, "dtype": "float32", "beta_constraint": null, "axis": [3], "epsilon": 0.001, "scale": true, "center": true}}, {"class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "trainable": true, "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "res4b_branch2b", "config": {"activation": "linear", "padding": "same", "kernel_regularizer": null, "name": "res4b_branch2b", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "dtype": "float32"}}, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "trainable": true, "dtype": "float32", "kernel_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "name": "bn4b_branch2b", "config": {"gamma_constraint": null, "momentum": 0.99, "name": "bn4b_branch2b", "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "trainable": 